# InternalDefinition Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
InternalDefinition Methods
InternalDefinition Class See Also
---
The InternalDefinition type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetDataType | Gets a ForgeTypeId identifying the data type describing values of the parameter.  (Inherited from Definition.) |
| GetGroupTypeId | Gets the identifier of the built-in parameter group to which the parameter defined by this definition belongs. (Overrides Definition..::..GetGroupTypeId()()()().) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetParameterTypeId | Tests whether this definition identifies a built-in parameter or not. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| GetTypeId | Gets the identifier of the parameter. |
| SetAllowVaryBetweenGroups | Whether or not the parameter values can vary across group members. |
| SetGroupTypeId | Sets the built-in parameter group to which the parameter defined by this definition belongs. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
InternalDefinition Class
Autodesk.Revit.DB Namespace